import React, { useEffect, useRef } from 'react';
import { gsap } from 'gsap';
import { MotionPathPlugin } from 'gsap/MotionPathPlugin';

gsap.registerPlugin(MotionPathPlugin);

const AnimatedRocket = () => {
  const rocket1Ref = useRef(null);
  const rocket2Ref = useRef(null);
  const rocket3Ref = useRef(null);
  const pathRef = useRef(null);

  useEffect(() => {
    const rocket1 = rocket1Ref.current;
    const rocket2 = rocket2Ref.current;
    const rocket3 = rocket3Ref.current;
    const rocketGroup = [rocket1, rocket2, rocket3]; // 로켓 그룹을 배열로 만듭니다.
    
    gsap.set(rocket1, { x: 1600, y: 1000 }, {rotation: 0}); // 초기 위치 설정
    gsap.set(rocket2, { x: 1600, y: 1000 }, {rotation: 0}); // 초기 위치 설정
    gsap.set(rocket3, { x: 1600, y: 1000 }, {rotation: 0}); // 초기 위치 설정
    gsap.set(".rocket", { transformOrigin: "100% 100%" }, {x: 1600, y: 900});
  
    gsap.to(rocketGroup, { // 로켓 그룹에 대한 애니메이션을 적용합니다.
      duration: 3,
      repeat: 0,
      ease: "power1.inOut",
      motionPath: {
        path: pathRef.current,
        align: "self",
      },
      onUpdate: function() {
        const progress = this.progress();
        let rotationAngle;
        if (progress <= 0.6) {
          rotationAngle = 0 - progress * 90;
        } else {
          rotationAngle = -90 + (progress - 0.6) * 180;
        }
        gsap.set(rocketGroup, { rotation: rotationAngle }); // 로켓 그룹에 회전을 적용합니다.
      },
      onComplete: function() {
        gsap.to(rocketGroup, { opacity: 0, duration: 1 }); // 모션 완료 후 opacity를 0으로 만드는 애니메이션 추가
      }
    });
  }, []);
  
  

  return (
    <div className="container">
      {/* SVG를 HTML 요소로 포함 */}
      <svg width="100%" viewBox="0 0 1920 1080">
        {/* path 요소는 여기에 추가 */}
        <path
          ref={pathRef}
          d="M1631.4 1122.4V843.6c0-98.2-56.6-187.8-145.7-229-81.1-37.6-398.5-68.6-589.4-68.6-482 0-811.1-228.2-811.1-463.4"
          fill="none"
          stroke="#1d1d1b"
          strokeMiterlimit="10"
        />
        {/* 로켓 이미지를 path 요소로 변환하여 HTML에 포함 */}
        <path 
         ref={rocket1Ref} className='rocket1'
         fill="#111" d="M75.662 102.259c-.352-9.698-1.234-13.4-3.879-17.28-2.644-3.878-6.7-4.583-6.7-4.583s.53-6.7-.352-20.63c-.882-13.928-7.934-32.265-11.108-38.965-2.116-4.231-6.524-12.694-9.52-18.16-1.588-2.821-5.29-3.527-7.759-1.41-15.868 14.28-20.1 40.904-20.1 40.904-2.115 10.05-4.408 22.392-4.408 37.203v2.292l-3.702 2.292-7.405 18.337s-.882 1.763-.706 3.526c.177 1.587 2.469 23.803 2.469 23.803s.352 4.055 3.173 4.055 4.76-3.526 6.877-5.819c1.94-2.292 8.815-9.697 10.755-9.873 1.587.352 8.463 1.587 18.16 1.587 7.406 0 10.58-.353 13.048-1.411 3.173 3.174 16.397 16.045 18.69 16.045 1.586 0 1.939-3.703 2.468-6.877.528-3.35.528-15.339 0-25.036ZM38.99 9.693s4.76 7.758 5.29 10.05c.528 2.116 3.702 9.169 5.112 12.166 1.235 2.997 3.703 10.05 3.703 10.05h-28.74c0 .176 4.232-22.745 14.635-32.266ZM8.663 119.538c-.353-1.94-1.41-11.108-1.587-13.753-.176-2.645.353-3.174 2.116-7.405 1.586-3.88 3.35-6.171 3.702-6.7 1.235 8.816 3.527 17.102 4.056 20.1 0 .176 0 .176.176.352-2.645 1.764-8.463 7.406-8.463 7.406Zm32.794-7.758c-6.876 0-13.047-.529-15.692-.882-.705 0-1.41-.705-1.587-1.41-1.057-4.408-4.407-19.748-4.407-30.15 0-12.166 1.763-21.334 1.763-21.334h35.263s1.234 7.052 1.234 14.634c0 6.876-2.292 30.502-3.174 37.202-.176.882-.881 1.411-1.587 1.587-1.939.176-5.818.353-11.813.353Zm26.8 8.816s-3.526-3.527-7.581-6.877c2.292-3.879 2.468-9.873 2.468-9.873l1.234-15.163c1.234 1.057 3.703 3.878 4.056 9.873.529 7.934-.177 22.04-.177 22.04Z"/>
         <path
         ref={rocket2Ref} className='rocket2'
          fill="#FFA300" d="m55.035 80.396-11.284-1.763-4.937-9.874-4.76 9.874-11.285 1.763 8.111 7.581-1.94 11.637 9.874-5.642 10.05 5.642-1.94-11.637 8.111-7.581Z"/>
        <path
          ref={rocket3Ref} className='rocket3'
         fill="#FFA300" d="M32.819 128c-1.587-.353-2.116.176-2.645.882-.529.705-2.468 4.76-3.879 8.286-1.41 3.527-2.82 8.287-2.997 9.169-.177.881.176 2.821 1.587 2.821 1.41 0 1.94-1.411 2.115-1.763.177-.353 2.293-5.995 2.998-7.934.705-1.94 2.644-6.877 3.173-8.816.882-1.763-.352-2.645-.352-2.645ZM39.872 136.64a1.913 1.913 0 0 0-1.587-1.763s-1.94-.353-2.116 1.763c-.176 1.939-.529 18.513-.529 21.334 0 2.821-.352 6.171 1.587 6.171 2.116 0 1.94-2.116 1.94-2.116.529-8.287.705-23.802.705-25.389ZM50.275 135.23c-1.058-2.469-2.293-1.763-2.645-1.587-.353.176-.882.352-1.058 1.41-.176 1.058 2.821 12.871 3.526 15.692.706 2.821 1.587 3.527 3.174 2.998 1.587-.353.882-3.35.882-3.35-.353-4.232-2.822-12.695-3.88-15.163Z" transform="scale(0.5)" />
      </svg>
    </div>
  );
};

export default AnimatedRocket;
